In [11]:
from pyspark.sql import SparkSession, types as t, functions as f
from pyspark.sql import Row

In [2]:
spark = SparkSession.builder.appName('notebook2_session').getOrCreate()

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

22/10/17 20:11:24 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
22/10/17 20:11:25 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.
22/10/17 20:11:25 WARN Utils: Service 'SparkUI' could not bind on port 4041. Attempting port 4042.

In [6]:
department1 = Row(id=1, name="IT")
department2 = Row(id=1, name="Accounting")
department3 = Row(id=1, name="Legal")

In [4]:
employee1 = Row(first_name='Sarah', second_name='Connor', age=40, salary=50000)
employee2 = Row(first_name='John', second_name='Connor', age=18, salary=40000)
employee3 = Row(first_name='Terminator', second_name='T800', age=5, salary=70000)
employee4 = Row(first_name='Terminator', second_name='T1000', age=3, salary=80000)

In [7]:
dept_it = Row(department=department1, employees=[employee3, employee4])
dept_accounting = Row(department=department2, employees=[employee1])
dept_legal = Row(department=department3, employees=[employee1, employee2, employee3])

In [9]:
departments = [dept_it, dept_accounting, dept_legal]

In [10]:
departments

[Row(department=Row(id=1, name='IT'), employees=[Row(first_name='Terminator', second_name='T800', age=5, salary=70000), Row(first_name='Terminator', second_name='T1000', age=3, salary=80000)]),
 Row(department=Row(id=1, name='Accounting'), employees=[Row(first_name='Sarah', second_name='Connor', age=40, salary=50000)]),
 Row(department=Row(id=1, name='Legal'), employees=[Row(first_name='Sarah', second_name='Connor', age=40, salary=50000), Row(first_name='John', second_name='Connor', age=18, salary=40000), Row(first_name='Terminator', second_name='T800', age=5, salary=70000)])]

In [13]:
df = spark.createDataFrame(departments)

In [15]:
df.show(truncate=False)

+---------------+-------------------------------------------------------------------------------------+
|department     |employees                                                                            |
+---------------+-------------------------------------------------------------------------------------+
|{1, IT}        |[{Terminator, T800, 5, 70000}, {Terminator, T1000, 3, 80000}]                        |
|{1, Accounting}|[{Sarah, Connor, 40, 50000}]                                                         |
|{1, Legal}     |[{Sarah, Connor, 40, 50000}, {John, Connor, 18, 40000}, {Terminator, T800, 5, 70000}]|
+---------------+-------------------------------------------------------------------------------------+

In [17]:
df.select('employees').show(truncate=False)

+-------------------------------------------------------------------------------------+
|employees                                                                            |
+-------------------------------------------------------------------------------------+
|[{Terminator, T800, 5, 70000}, {Terminator, T1000, 3, 80000}]                        |
|[{Sarah, Connor, 40, 50000}]                                                         |
|[{Sarah, Connor, 40, 50000}, {John, Connor, 18, 40000}, {Terminator, T800, 5, 70000}]|
+-------------------------------------------------------------------------------------+

In [21]:
df.select(f.explode('employees').alias('emps')).show(truncate=False)

+-----------------------------+
|emps                         |
+-----------------------------+
|{Terminator, T800, 5, 70000} |
|{Terminator, T1000, 3, 80000}|
|{Sarah, Connor, 40, 50000}   |
|{Sarah, Connor, 40, 50000}   |
|{John, Connor, 18, 40000}    |
|{Terminator, T800, 5, 70000} |
+-----------------------------+